# TP NoSQL

Prénom : Clément

Nom : Tang

Pour ce TP noté vous avez trois heures pour le réaliser et 48 heures pour le finir si besoin. Le rendu final est attendu pour dimanche 29 septembre 2024 à 23 h 59.

Vous serrez évalués sur les requêtes mais également sur la qualité et la propreté du code. Pour chaque question, une réponse présentant les résultats est attendue.

In [30]:
# installation des packages pandas et pymongo
!pip install -r requirements.txt --quiet

In [31]:
import pymongo
import pandas as pd

URI = 'mongodb+srv://user_mongo:ReI9rG5NfkMFFOvD@cluster-but-sd.eu0v2.mongodb.net/?retryWrites=true&w=majority&appName=cluster-but-sd'
client = pymongo.MongoClient(URI)
db = client.tp

# output the name of the collections in the database
print("Collections: ", db.list_collection_names())

Collections:  ['restaurants', 'movies']

1. Combien de films sont dans la base de données ?

In [36]:
db.movies.count_documents({})

#print('Il y a 23530 de films dans la base de données.')

23530

2. Quel est le nombre moyen de votes par pays ? Trier les pays par nombre moyen de votes décroissant.

In [238]:
avg_votes = db.movies.aggregate([
    { "$unwind": "$countries" },
    { "$group": {
        "_id": { "n": "$countries"},
        "votes": { "$avg": "$imdb.votes" }
    }},
    { "$sort": { "votes": -1}}
])
pd.DataFrame(list(avg_votes))

#print("A Malte, il y 210571.800000 de votes et au Bahamas, il y a 206061.000000 votes.")

                               _id          votes
0                   {'n': 'Malta'}  210571.800000
1                 {'n': 'Bahamas'}  206061.000000
2             {'n': 'New Zealand'}   66589.269231
3    {'n': 'United Arab Emirates'}   53495.833333
4                     {'n': 'USA'}   35016.703663
..                             ...            ...
153                {'n': 'Kosovo'}     104.500000
154               {'n': 'Moldova'}     104.000000
155           {'n': 'North Korea'}      92.666667
156                {'n': 'Brunei'}      51.000000
157               {'n': 'Vanuatu'}       6.000000

[158 rows x 2 columns]

3. Donner la liste des différents genres de films.

In [165]:
genre = db.movies.aggregate([
    { "$unwind": "$genres" },
    { "$group": {
        "_id": "$genres"
    }}
])
pd.DataFrame(list(genre))
#print("Il y a 25 genres de films.")

            _id
0   Documentary
1       Western
2         Music
3          News
4         Sport
5           War
6         Short
7        Comedy
8         Drama
9       Romance
10      Mystery
11    Biography
12    Adventure
13    Animation
14       Family
15       Horror
16     Thriller
17      Musical
18      History
19        Crime
20      Fantasy
21       Sci-Fi
22    Talk-Show
23    Film-Noir
24       Action

4. Combien de films ont une note IMDb supérieure à 8 ?

In [153]:
note = db.movies.aggregate([
    { "$match": { "imdb.rating": { "$gt": 8 }}},
    { "$group": {
        "_id": { "n": "$title"},
        "vote": { "$sum": "$imdb.rating" }
    }}
])
pd.DataFrame(list(note))

#IL y a 1122 de film qui ont une note supérieure à 8.

                                            _id  vote
0                                {'n': 'Dev D'}   8.1
1              {'n': 'Man with a Movie Camera'}   8.4
2                              {'n': 'Kahaani'}   8.2
3                          {'n': 'The Silence'}   8.1
4                           {'n': 'WWII in HD'}   8.7
...                                         ...   ...
1117               {'n': 'Lessons of Darkness'}   8.2
1118  {'n': 'Terry Pratchett: Choosing to Die'}   8.2
1119                              {'n': 'Meru'}   8.3
1120                     {'n': 'A Man Escaped'}   8.1
1121                          {'n': 'Dogville'}   8.1

[1122 rows x 2 columns]

5. Afficher le titre, l'année de sortie et les réalisateurs de tous les films (ne pas afficher l'ID).

In [194]:
films = db.movies.find(
    {},
    { "_id": 0 , "title": 1, "year": 1, "directors": 1}
)
pd.DataFrame(list(films))

#le titre du film est Intolerance: Love's Struggle Throughout the Ages	et le réalisateur est D.W. Griffith en 1916.

,title,directors,year
0,Intolerance: Love's Struggle Throughout the Ages,[D.W. Griffith],1916
1,The Poor Little Rich Girl,[Maurice Tourneur],1917
2,The Kid,[Charles Chaplin],1921
3,Miss Lulu Bett,[William C. de Mille],1921
4,Safety Last!,"[Fred C. Newmeyer, Sam Taylor]",1923
...,...,...,...
23525,Emelie,[Michael Thelin],2015
23526,Techo y comida,[Juan Miguel del Castillo],2015
23527,Nahid,[Ida Panahandeh],2015
23528,Coin Locker Girl,[Jun-hee Han],2015
23529,Tryapichnyy soyuz,[Mikhail Mestetskiy],2015

6. Afficher le titre et le plot des films réalisés par D.W. Griffith.

In [264]:
a= db.movies.find(
    { "directors": "D.W. Griffith" },
    { "_id": 0, "title": 1, "plot": 1 }
)
pd.DataFrame(list(a))

#films réalisés par D.W. Griffith: plot: The story of a poor young woman, separated by ...	et title: Intolerance: Love's Struggle Throughout the Ages

,plot,title
0,"The story of a poor young woman, separated by ...",Intolerance: Love's Struggle Throughout the Ages
1,"A greedy tycoon decides, on a whim, to corner ...",A Corner in Wheat
2,"A frail waif, abused by her brutal boxer fathe...",Broken Blossoms or The Yellow Man and the Girl
3,The Civil War divides friends and destroys fam...,The Birth of a Nation

7. Quels sont les 5 acteurs les plus populaires (ceux qui ont joué dans le plus de films) ?

In [184]:
top5 = db.movies.aggregate([
    { "$unwind": "$cast" },
    { "$group": { "_id": "$cast", "nb": { "$sum": 1 }}},
    { "$sort": { "nb": -1 }},
    { "$limit": 5}
])
pd.DataFrame(list(top5))

print("Il y a Gèrard Depardieu, Robert De Niro, Michael Caine, Marcello Mastroianni, Max von Sydow.")

Il y a Gèrard Depardieu, Robert De Niro, Michael Caine, Marcello Mastroianni, Max von Sydow.

8. Quelles sont les 6 années avec le plus de films produits ?

In [288]:
top6 = db.movies.aggregate([
    { "$sortByCount": "$year"},
    { "$limit": 6}
])
pd.DataFrame(list(top6))

#Il y a 2013, 2014, 2012, 2011, 2009, 2010.

    _id  count
0  2013   1220
1  2014   1147
2  2012   1109
3  2011   1040
4  2009    990
5  2010    970

9. Combien de films ont été réalisés avant l'année 2000 et ont une note IMDb supérieure à 7 ?

In [230]:
réaliser = db.movies.aggregate([
    { "$match": { "year": { "$lt": 2000 }}},
    {"$match":{"imdb.rating":{"$gt":7}}},
    { "$sortByCount": "$_id"}
])
pd.DataFrame(list(réaliser))

#il y a 4747 films qui ont été réalisés avant l'année 2000 et ont une note IMDb supérieure à 7.

                           _id  count
0     573a1394f29313caabce0622      1
1     573a1398f29313caabce9568      1
2     573a1397f29313caabce70b4      1
3     573a1398f29313caabcea52b      1
4     573a1394f29313caabcde75e      1
...                        ...    ...
4742  573a1397f29313caabce5c88      1
4743  573a1396f29313caabce50e8      1
4744  573a1397f29313caabce6f84      1
4745  573a139af29313caabcf0f54      1
4746  573a139ef29313caabcfbdb9      1

[4747 rows x 2 columns]

10. Donner les 20 réalisateurs qui ont réalisé le plus de films (afficher seulement leur nom et le nombre de films).

In [236]:
top20 = db.movies.aggregate([
    { "$match": { "directors": { "$exists": True }}},
    { "$sortByCount": "$directors"},
    { "$limit": 20}    
])
pd.DataFrame(list(top20))

#le premier est Woody Allen avec 39 films réalisés.

                       _id  count
0            [Woody Allen]     39
1          [Takashi Miike]     33
2       [Alfred Hitchcock]     31
3          [Werner Herzog]     31
4            [John Huston]     30
5        [Martin Scorsese]     29
6           [Sidney Lumet]     29
7              [John Ford]     29
8       [Steven Spielberg]     28
9         [Clint Eastwood]     27
10         [Robert Altman]     27
11         [Michael Apted]     27
12             [Spike Lee]     26
13     [Steven Soderbergh]     26
14  [Michael Winterbottom]     25
15        [Ingmar Bergman]     25
16          [Ridley Scott]     24
17       [Mario Monicelli]     24
18          [George Cukor]     24
19        [Claude Chabrol]     23

11. Quelle est la note IMDb moyenne des films sortis après 2010 ?

In [258]:
avg_note = db.movies.aggregate([
    { "$match": { "year": { "$gt": 2010 }}},
    { "$group": {"_id": "movies",
        "notes": { "$avg": "$imdb.rating" }
    }}
])
pd.DataFrame(list(avg_note))

#la note IMDb moyenne des films sortis après 2010 est de 6.544033.

      _id     notes
0  movies  6.544033

12. (bonus) Afficher les films dont le titre contient le mot "love".

In [278]:
film = db.movies.aggregate([
    {"$match": {"title": {"$regex": "^love", "$options": "i"}}},
    {"$project": {"_id": 0, 
            "title": 1 
        }
    }
])

pd.DataFrame(list(film))

#Il y a Love Finds Andy Hardy, Love Me TonightLove on the Dole
3	Love Is a Many-Splendored Thing
4	Love Me or Leave Me

                               title
0              Love Finds Andy Hardy
1                    Love Me Tonight
2                   Love on the Dole
3    Love Is a Many-Splendored Thing
4                Love Me or Leave Me
..                               ...
123              Love at First Fight
124                      Love Steaks
125        Love Is the Perfect Crime
126                        Lovemilla
127                             Love

[128 rows x 1 columns]

13. (bonus) Afficher le titre des films ayant un score Rotten Tomatoes (viewer) supérieur à 75.

In [286]:
reponse13 = db.movies.aggregate([
    {
        "$match": {"tomatoes.viewer.meter": {"$gt": 75}}  
    },
    {
        "$project": {
            "_id": 0, 
            "title": 1,
            "tomatoes.viewer.meter": 1
        }
    }
])

pd.DataFrame(list(reponse13))

,title,tomatoes
0,Intolerance: Love's Struggle Throughout the Ages,{'viewer': {'meter': 78}}
1,The Poor Little Rich Girl,{'viewer': {'meter': 77}}
2,The Kid,{'viewer': {'meter': 96}}
3,Safety Last!,{'viewer': {'meter': 93}}
4,Wild Oranges,{'viewer': {'meter': 91}}
...,...,...
6597,Luton,{'viewer': {'meter': 100}}
6598,Amira & Sam,{'viewer': {'meter': 76}}
6599,Misconception,{'viewer': {'meter': 100}}
6600,Grace,{'viewer': {'meter': 86}}
6601,Batman: Assault on Arkham,{'viewer': {'meter': 86}}